In [95]:
import pandas as pd
from sqlalchemy import create_engine
import getpass

In [108]:
engine = create_engine("mysql+mysqlconnector://root:root@localhost:3306/sakila")

In [109]:
query = "USE sakila"

In [110]:
import pandas as pd

def rentals_month(engine, month, year):
    """
    Retrieves rental data for a given month and year from the Sakila database.

    Parameters:
        engine: SQLAlchemy Engine - Database connection engine for the Sakila database.
        month: int - The month for which rental data is to be retrieved (1-12).
        year: int - The year for which rental data is to be retrieved.

    Returns:
        pandas.DataFrame: A DataFrame containing the rental data for the specified month and year.
    """
    try:
        # Validate the month parameter
        if not (1 <= month <= 12):
            raise ValueError("Month must be an integer between 1 and 12.")

        # SQL query to fetch rental data for the given month and year
        query = f"""SELECT rental_date, customer_id FROM rental
                    WHERE true
                    AND MONTH(rental_date) = {month}
                    AND YEAR(rental_date) = {year};
        """

        # Execute the query and return the results as a pandas DataFrame
        with engine.connect() as connection:
            df = pd.read_sql(query, connection)
            print("Datos de prueba de la tabla 'rental':")
            #print(df)

        return df

    except Exception as e:
        print("Error al obtener datos de la tabla:", e)

In [117]:
df_rentals = rentals_month(engine, 6, 2005)

Datos de prueba de la tabla 'rental':

In [118]:
df_rentals

             rental_date  customer_id
0    2005-06-14 22:53:33          416
1    2005-06-14 22:55:13          516
2    2005-06-14 23:00:34          239
3    2005-06-14 23:07:08          285
4    2005-06-14 23:09:38          310
...                  ...          ...
2306 2005-06-21 22:10:01          510
2307 2005-06-21 22:13:33          226
2308 2005-06-21 22:19:25          543
2309 2005-06-21 22:43:45          100
2310 2005-06-21 22:48:59          181

[2311 rows x 2 columns]

In [ ]:
import pandas as pd

def rental_count_month(df, month, year):

    try:
        # Ensure that the input DataFrame contains the necessary columns
        if 'customer_id' not in df.columns or 'rental_date' not in df.columns:
            raise ValueError("The DataFrame must contain 'customer_id' and 'rental_date' columns.")

        # Convert rental_date to datetime if it isn't already
        df['rental_date'] = pd.to_datetime(df['rental_date'])

        # Filter the DataFrame for the specified month and year
        df_filtered = df[(df['rental_date'].dt.month == month) & (df['rental_date'].dt.year == year)]

        # Count the number of rentals by each customer
        rental_count = df_filtered.groupby('customer_id').size().reset_index(name='rental_count')

        # Create the dynamic column name based on the month and year
        column_name = f"rentals_{month:02d}_{year}"

        # Rename the 'rental_count' column to the dynamically generated name
        rental_count.rename(columns={'rental_count': column_name}, inplace=True)

        return rental_count

    except Exception as e:
        print(f"An error occurred: {e}")
        return None

In [124]:
rental_count_month(df_rentals, 6, 2005)

     customer_id  rentals_06_2005
0              1                7
1              2                1
2              3                4
3              4                6
4              5                5
..           ...              ...
585          595                2
586          596                2
587          597                3
588          598                1
589          599                4

[590 rows x 2 columns]

In [ ]:
import pandas as pd

def compare_rentals(df1, df2, column1, column2):

    try:
        # Merge the two DataFrames on 'customer_id'
        df_merged = pd.merge(df1[['customer_id', column1]], df2[['customer_id', column2]], on='customer_id', how='outer')

        # Fill NaN values with 0 in case some customers don't have rentals in one of the months
        df_merged[column1] = df_merged[column1].fillna(0)
        df_merged[column2] = df_merged[column2].fillna(0)

        # Calculate the difference between the two rental counts
        df_merged['difference'] = df_merged[column1] - df_merged[column2]

        return df_merged

    except Exception as e:
        print(f"An error occurred: {e}")
        return None

In [127]:
# Ejemplo de datos de mayo de 2005
df_may = pd.DataFrame({
    'customer_id': [101, 102, 103],
    'rentals_05_2005': [3, 5, 2]
})

# Ejemplo de datos de junio de 2005
df_june = pd.DataFrame({
    'customer_id': [102, 103, 104],
    'rentals_06_2005': [4, 1, 7]
})

# Comparamos los alquileres de mayo y junio
df_comparison = compare_rentals(df_may, df_june, "rentals_05_2005", "rentals_06_2005")
print(df_comparison)

   customer_id  rentals_05_2005  rentals_06_2005  difference
0          101              3.0              0.0         3.0
1          102              5.0              4.0         1.0
2          103              2.0              1.0         1.0
3          104              0.0              7.0        -7.0